#+BEGIN_COMMENT
.. title: Introduction to Dask
.. slug: introduction-to-dask
.. date: 2021-11-15 18:30:38 UTC-08:00
.. tags: dask,tutorial
.. category: Dask
.. link:
.. description: The dask interpretation of the first ray tutorial.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-96f97957-284d-46df-a0a4-53ce0a063240-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
# %load_ext autotime
#+END_SRC
* So Run It Already

First we'll sleep a little to improve the accuracy of the timing measurements. We do this because workers may still be starting up in the background (probably not, in this case, since I'm typing this post, but in other cases maybe). We're telling it to sleep for one second, but there's also some overhead (a little from python and a little more from ray) so we're going to check that the amount added is within reason (1 second plus our tolerance).

#+begin_src python :results output :exports both
TOLERANCE = 0.1
EXPECTED_UPPER_BOUND_FOR_RUNTIME = SECONDS_TO_SLEEP + TOLERANCE

start_time = time.time()

futures = client.map(sleepy, range(PARALLEL_CALLS))
results = client.gather(futures)
end_time = time.time()
duration = end_time - start_time

print(f"This is what the function-calls returned: {results}.")
print(f"The non-parallel run time would have taken at least {PARALLEL_CALLS} seconds.")
print(f"The parallel version took {duration:0.2f} seconds.")

expect(results).to(contain_exactly(*list(range(PARALLEL_CALLS))))
expect(duration).to(be_below(EXPECTED_UPPER_BOUND_FOR_RUNTIME))
expect(duration).to(be_above(SECONDS_TO_SLEEP))
#+end_src

#+RESULTS:
: This is what the function-calls returned: [0, 1, 2, 3, 4].
: The non-parallel run time would have taken at least 5 seconds.
: The parallel version took 1.04 seconds.

So it does about as well as ray did. One interesting aspect of dask, though, is that it expects to be given [[https://en.wikipedia.org/wiki/Pure_function]["pure" functions]], meaning no side-effects and a particular input will always give the same output. Because of that second condition, it will (by default, it can be overridden) cache the outputs for a certain input, so calling the same function with the same inputs won't actually execute the function over again. I'll run the exact same code again and we can see how this affects the running time.

#+begin_src python :results output :exports both
start_time = time.time()

futures = client.map(sleepy, range(PARALLEL_CALLS))
results = client.gather(futures)
end_time = time.time()
duration = end_time - start_time

print(f"This is what the function-calls returned: {results}.")
print(f"The non-parallel run time would have taken at least {PARALLEL_CALLS} seconds.")
print(f"The parallel version took {duration:0.2f} seconds.")

expect(results).to(contain_exactly(*list(range(PARALLEL_CALLS))))
expect(duration).to(be_below(EXPECTED_UPPER_BOUND_FOR_RUNTIME))
# expect(duration).to(be_above(SECONDS_TO_SLEEP))
#+end_src

#+RESULTS:
: This is what the function-calls returned: [0, 1, 2, 3, 4].
: The non-parallel run time would have taken at least 5 seconds.
: The parallel version took 0.03 seconds.

So now we can see that the overhead takes about 0.03 seconds (although where that occurred is hard to say) and that no matter how long our functions might have taken the first time, they would always take some very small amount the second time they're called with the same arguments.
